# SetDLComponentClass

## Description
Sets the class of the component at index in the Double Line Preferences.

```pascal
FUNCTION SetDLComponentClass(
				index          : INTEGER;
				componentClass : LONGINT): BOOLEAN;
```

```python
def vs.SetDLComponentClass(index, componentClass):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|index|INTEGER|The index of the component.|
|componentClass|LONGINT|The class of the component.|

## Remarks
CJG 3-23-07

## See Also
VS Functions:
GetDLComponentClass

## Version
Availability: from VectorWorks13.0

## Category
* Document Settings